Repository: Akmenah/egoevdeapp
Catalog: lib/l10n/app_*.arb
Languages: tr

# homePage
source: Home
tr: Ana Sayfa

# addRouteButton
source: Add Stop Pair +
tr: Durak Çifti Ekle +

# errorPrefix
source: Error:
tr: Hata:

source: Last update:
tr: Son güncelleme:

source: seconds ago
tr: saniye önce

source: minutes ago
tr: dakika önce

source: hours ago
tr: saat önce

source: Show Stop Info
tr: Durak Bilgilerini Göster

# addNewRouteTitle
source: Add New Stop Pair
tr: Yeni Durak Çifti Ekle

# routeNameLabel
source: Route Pair Name
tr: Durak Çifti Adı

# routeNameHint
source: E.g: Home to Work
tr: Örn: Evden İşe

# routeNameRequired
source: Route pair name is required
tr: Durak çifti adı gerekli

source: First Stop
tr: Birinci Durak

source: Second Stop
tr: İkinci Durak

# stopNumberLabel
source: Stop No
tr: Durak No

# stopNumberHint
source: E.g: 12345
tr: Örn: 12345

# stopNumberRequired
source: Stop number is required
tr: Durak numarası gerekli

# lineNumberLabel
source: Line No
tr: Hat No

# lineNumberHint
source: E.g: 123
tr: Örn: 123

# lineNumberRequired
source: Line number is required
tr: Hat numarası gerekli

# stopNameLabel
source: Stop Name
tr: Durak Adı

# stopNameHint
source: E.g: Home/Work Direction
tr: Örn: Ev/İş Yönü

# saveRouteButton
source: Save Stop Pair
tr: Durak Çiftini Kaydet

# routeAddedSuccess
source: Stop pair added successfully!
tr: Durak çifti başarıyla eklendi!

source: Direction 1
tr: 1. Yön

source: Direction 2
tr: 2. Yön

# lineAbbr
source: Line
tr: Hat

source: Estimated Arrival
tr: Tahmini Varış

# vehicleNumber
source: Vehicle No
tr: Araç No

source: Plate
tr: Plaka

source: Stop Order
tr: Durak Sırası

source: Features
tr: Özellikler

# noBusesFound
source: No buses found on route.
tr: Seferde araç bulunamadı.

source: Delete Routes
tr: Durakları Sil

source: Cancel
tr: İptal

source: Confirm Delete
tr: Silmeyi Onayla

# deleteRouteConfirmation
source: Delete route
tr: Durak çiftini sil

source: Delete
tr: Sil

source: Edit Routes
tr: Durakları Düzenle

# editRouteTitle
source: Edit Stop Pair
tr: Durak Çiftini Düzenle

# updateRouteButton
source: Update Stop Pair
tr: Durak Çiftini Güncelle

# routeUpdatedSuccess
source: Stop pair updated successfully!
tr: Durak çifti başarıyla güncellendi!

source: Arrived
tr: Geldi

source: Settings
tr: Ayarlar

source: Language
tr: Dil

# languageSubtitle
source: Choose your preferred language
tr: Tercih ettiğiniz dili seçin

# themeMode
source: Theme
tr: Tema

# themeModeSubtitle
source: Choose light, dark, or system theme
tr: Açık, koyu veya sistem teması seçin

# lightMode
source: Light
tr: Açık

# darkMode
source: Dark
tr: Koyu

# systemMode
source: System
tr: Sistem

source: Delete All Data
tr: Tüm Verileri Sil

# deleteAllDataSubtitle
source: Delete all saved route pairs
tr: Kaydedilmiş tüm durak çiftlerini sil

source: Confirm Delete All
tr: Tüm Verileri Silme Onayı

# deleteAllDataConfirmation
source: Are you sure you want to delete all saved route pairs? This action cannot be undone.
tr: Kaydedilmiş tüm durak çiftlerini silmek istediğinizden emin misiniz? Bu işlem geri alınamaz.

# allDataDeleted
source: All data deleted successfully
tr: Tüm veriler başarıyla silindi

# languageChangeNotImplemented
source: Language change requires app restart (not implemented yet)
tr: Dil değişikliği uygulama yeniden başlatma gerektirir (henüz uygulanmadı)

# themeModeChangeNotImplemented
source: Theme mode change requires app restart (not implemented yet)
tr: Tema modu değişikliği uygulama yeniden başlatma gerektirir (henüz uygulanmadı)
